Revit 2026 API

# ColorWithTransparencySetRed Method

---

set red

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetRed(
	uint red
)
```
```vb
Public Sub SetRed (
	red As UInteger
)
```
```cpp
public:
void SetRed(
	unsigned int red
)
```
```fsharp
member SetRed :
        red : uint32 -> unit
```

#### Parameters

red UInt32
     red

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

#### Reference

ColorWithTransparency Class

Autodesk.Revit.DB Namespace